app/controllers/movies_controller.rb

  def show
    @fans = @movie.fans
    @genres = @movie.genres
    if current_user
      @current_favorite = current_user.favorites.find_by(movie_id: @movie.id)
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = ? LIMIT ?  [["user_id", 4], ["movie_id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 1]]

  def update
    if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Updated Movie Title"], ["updated_at", "2018-09-16 14:32:26.343169"], ["id", 1]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "rating", "total_gross", "created_at", "updated_at", "description", "released_on", "cast", "director", "duration", "image_file_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def set_movie
    @movie = Movie.find_by!(slug: params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."slug" = ? LIMIT ?  [["slug", "12"], ["LIMIT", 1]]