app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$t/AlOUf88Gw9mngiMfc6S.kqgqOaQK016QcaU4rXiFO1ah7Zl1CiS"], ["username", "spiderman"], ["updated_at", "2018-09-18 19:54:53.053963"], ["id", 2]]